Revit 2027 API
ScheduleDefinition.ClearFields Method
 Removes all fields.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearFields()
Public Sub ClearFields
public:
void ClearFields()
member ClearFields : unit -> unit
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace